//? 1. What is the difference between setTimeout and setInterval ?
// //!  Answer:
// setTimeout: یک تابع رو یک بار بعد از یه مدت مشخص اجرا می‌کنه.
// setInterval: یک تابع رو به طور مداوم با فاصله زمانی مشخص اجرا می‌کنه.
// setTimeout: برای کارهایی که فقط یک بار اتفاق بیفته، مثلا نمایش یک پیام بعد از چند ثانیه.
// setInterval: برای کارهایی که به صورت مداوم تکرار بشه، مثلا انیمیشن‌ها، بازی‌ها، یا آپدیت کردن اطلاعات.

// برای متوقف کردن یک تایمر که با setInterval ایجاد شده، از تابع clearInterval استفاده می‌کنیم.
// setTimeout: یک بار اجرا می‌شود.
// setInterval: به طور مکرر اجرا می‌شود.